<?php
/**
 * In work
 * ToDo 2. Разработать форму обратной связи. Форма должна включать следующие поля: 1) имя; 2) email; 3) текст сообщения. Все поля обязательные. Необходимо предусмотреть валидацию поля email. Значения нужно сохранять в базу данных MySQL (с использованием PDO). *
 * ToDo * Задания 2 и 3 должны быть реализованы по шаблону проектирования MVC.
 *
 * Complete
 * 1. Реализовать сортировку таблицы (sorting-js.html) на Javascript с учетом типа столбца (указан в атрибуте data-type). Сортировка должна выполняться при клике на заголовок столбца. При повторном клике по заголовку отсортированного столбца необходимо отсортировать таблицу в обратном порядке.
 * 3. Дан текстовый файл размером 2ГБ. Напишите класс, реализующий интерфейс SeekableIterator, для чтения данного файла. Элементом списка считать одну строку текстового файла (оканчиваются \n). Для генерации текстового файла размером 2 Гб можно воспользоваться скриптом (в приложении). Для оценки производительности своего решения предлагаем написать простенький скрипт для выборки 10 000 случайных записей.
 */
?>